nxp-mcuxpresso/mcux-soc-svd/MCXA144/MCXA144.xml
        <register>
          <name>TSTAT</name>
          <description>Trigger Status Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>TEXC_NUM</name>
              <description>Trigger Exception Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EXCEPTIONS</name>
                  <description>No triggers have been interrupted by a high priority exception. Or CFG[TRES] = 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT0_MEANS_TRIGGER_0_INTERRUPTED</name>
                  <description>Trigger 0 has been interrupted by a high priority exception.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT1_MEANS_TRIGGER_1_INTERRUPTED</name>
                  <description>Trigger 1 has been interrupted by a high priority exception.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_3</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_4</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_5</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_6</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_7</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_8</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_9</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_10</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_11</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_12</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_13</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_14</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_BITS_SET_INDICATE_ALL_TRIGGERS_INTERRUPTED</name>
                  <description>Every trigger sequence has been interrupted by a high priority exception.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCOMP_FLAG</name>
              <description>Trigger Completion Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TRIGGER</name>
                  <description>No triggers have been completed. Trigger completion interrupts are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT0_MEANS_TRIGGER_0_COMPLETED</name>
                  <description>Trigger 0 has been completed and trigger 0 has enabled completion interrupts.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT1_MEANS_TRIGGER_1_COMPLETED</name>
                  <description>Trigger 1 has been completed and trigger 1 has enabled completion interrupts.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_3</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_4</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_5</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_6</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_7</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_8</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_9</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_10</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_11</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_12</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_13</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_14</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_BITS_SET_INDICATE_ALL_TRIGGERS_COMPLETED</name>
                  <description>Every trigger sequence has been completed and every trigger has enabled completion interrupts.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OFSTRIM</name>
          <description>Offset Trim Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFSTRIM</name>
              <description>Trim for Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HSTRIM</name>
          <description>High Speed Trim Register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTRIM</name>
              <description>Trim for High Speed Conversions</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TCTRL[%s]</name>
          <description>Trigger Control Register</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HTEN</name>
              <description>Trigger Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Hardware trigger source disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Hardware trigger source enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPRI</name>
              <description>Trigger Priority Setting</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGHEST_PRIORITY</name>
                  <description>Set to highest priority, Level 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_LOWER_PRIORITY_1</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_LOWER_PRIORITY_2</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWEST_PRIORITY</name>
                  <description>Set to lowest priority, Level 4</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSYNC</name>
              <description>Trigger Resync</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDLY</name>
              <description>Trigger Delay Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCMD</name>
              <description>Trigger Command Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_VALID</name>
                  <description>Not a valid selection from the command buffer. Trigger event is ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXECUTE_CMD1</name>
                  <description>CMD1 is executed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXECUTE_CORRESPONDING_CMD_2</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXECUTE_CORRESPONDING_CMD_3</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXECUTE_CORRESPONDING_CMD_4</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXECUTE_CORRESPONDING_CMD_5</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXECUTE_CORRESPONDING_CMD_6</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXECUTE_CMD7</name>
                  <description>CMD7 is executed</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCTRL0</name>
          <description>FIFO Control Register</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FCOUNT</name>
              <description>Result FIFO Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FWMARK</name>
              <description>Watermark Level Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GCC0</name>
          <description>Gain Calibration Control</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GAIN_CAL</name>
              <description>Gain Calibration Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDY</name>
              <description>Gain Calibration Value Valid</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GAIN_CAL_NOT_VALID</name>
                  <description>The GAIN_CAL value is invalid. Run the hardware calibration routine for this value to be set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDWARE_CAL_ROUTINE_COMPLETED</name>
                  <description>The GAIN_CAL value is valid. GAIN_CAL should be used by software to derive GCRa[GCALR].</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GCR0</name>
          <description>Gain Calculation Result</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GCALR</name>
              <description>Gain Calculation Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDY</name>
              <description>Gain Calculation Ready</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_VALID</name>
                  <description>The GCALR value is invalid.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>The GCALR value is valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
